Repository: ikushlianski/full-width-images-on-narrow-screens
Catalog: languages/*.po
Languages: ru_ru

source: Most of works were created for practice and demonstration
ru_ru: Работы создавались полностью самостоятельно с нуля, в основном для наработки практики в той или иной технологии

source: All works
ru_ru: Все работы

source: Search Results for: %s
ru_ru: Результаты поиска для: %s

source: Nothing Found
ru_ru: Ничего не найдено

source: Sorry, but nothing matched your search terms. Please try again with some different keywords.
ru_ru: Извините, ничего по Вашему запросу не найдено. Пожалуйста, попробуйте задать немного другой запрос.

source: It seems we can&rsquo;t find what you&rsquo;re looking for. Perhaps searching can help.
ru_ru: Кажется, ничего не найдено. Возможно, Вам поможет поиск по сайту.

source: Skill summary
ru_ru: Коротко о навыке

source: : what I already know
ru_ru: : что я уже знаю

source: : further learning plans
ru_ru: : дальнейшие планы по изучению

source: See all %d
ru_ru: Посмотреть все %d

source: Work summary
ru_ru: Кратко о работе

source: Continue reading<span class="screen-reader-text"> "%s"</span>
ru_ru: Продолжить чтение<span class="screen-reader-text"> "%s"</span>

source: See project live
ru_ru: Посмотреть live

source: Technologies used
ru_ru: Использованные технологии

source: Project goals
ru_ru: Цели проекта

source: Challenges during project
ru_ru: Трудности в ходе проекта

source: Description
ru_ru: Описание
