Repository: ikushlianski/full-width-images-on-narrow-screens
Catalog: languages/*.po
Languages: ru_ru

source: See my CV
ru_ru: Посмотреть моё резюме

source: Oops! That page can&rsquo;t be found.
ru_ru: Такой страницы, к сожалению, не существует.

source: It looks like nothing was found at this location. Maybe try one of the links below or a search?
ru_ru: Ничего по данному адресу не найдено. Возможно, Вам помогут данные ссылки либо поиск по сайту

source: Most Used Categories
ru_ru: Самые используемые категории

source: Try looking in the monthly archives. %1$s
ru_ru: Попробуйте поискать в архивах. %1$s

source: Small examples
ru_ru: Небольшие наработки

source: See live
ru_ru: Посмотреть

source: One thought on &ldquo;%1$s&rdquo;
ru_ru: Мысль по поводу &ldquo;%1$s&rdquo;

# comments title
source: %1$s thought on &ldquo;%2$s&rdquo;
ru_ru: %1$s мнение по поводу &ldquo;%2$s&rdquo;

source: Comment navigation
ru_ru: Перемещение по комментариям

source: Older Comments
ru_ru: Более давние комментарии

source: Newer Comments
ru_ru: Свежие комментарии

source: Comments are closed.
ru_ru: Комментирование закрыто

source: Primary
ru_ru: Главный

source: Sidebar
ru_ru: Боковая панель

# Post Type General Name
source: Small works
ru_ru: Наработки

# Post Type Singular Name
source: Small work
ru_ru: Наработка

source: Skip to content
ru_ru: К содержанию

source: Menu
ru_ru: Меню

source: My personality
ru_ru: Мои личностные качества

source: My IT knowledge is like small bricks. I dream of building beautiful houses
ru_ru: Владею знаниями-кирпичиками. Хочу строить красивые дома

source: Why did you start learning code?
ru_ru: Почему ты стал учить программирование?

source: I have always thought I could program, because a PC was around in my life from early childhood, but it mostly didn't go further than advanced Word and Excel, Photoshop or Game Maker.
ru_ru: Компьютер всегда был рядом со мной по жизни, но как правило дела не доходили сильно дальше продвинутого Word и Excel, базового Photoshop, а также моего любимого режима редактора в любой игре (а порой редактировал игры и там где редактора не было). Был еще Game Maker.

source: Then an idea about a Minsk tourism marketing service came to my mind in 2015, but after a year of endless Joomla plugins and CSS/html tweaking of default templates I finally understood I would not make a worthy service without decent knowledge of programming.
ru_ru: После окончания первого высшего пришла в голову идея создать маркетинговое агентство для продвижения Минска за рубежом. Решил начать с сайта еще в 2015 г., однако после года ковыряний в HTML/CSS дефолтных шаблонов Joomla (тогда ничего этого я изучать детально не планировал) я видел, что бизнес-модель уже продумана и готова, но при этом осознавал, что без изучения основ программирования, в том числе backend, у меня не получится создать достойный качественный продукт.

source: It was scary at first, but then I loved the freedom of opportunities that open up to a programmer and many other ideas have come to me since then, some of which have become equally attractive as the tourism marketing project.
ru_ru: Сначала было страшно, но открыл Javascript в codeschool и w3schools и дело пошло. Сначала ничего не было понятно, вопросы "зачем это, зачем вон то"... Но потом, спустя месяцы, мне стала нравиться свобода действий, которая открывается кодеру, я стал обращать много внимания на то, как устроены другие сайты.

source: After becoming able to code things on my own I got a lot of new ideas which I never thought I would be able to implement myself: own services, advertizing, projects to improve my city Minsk and even the whole country in terms of social and political life.
ru_ru: Когда пришло понимание о том, как работают веб-проекты, у меня в голове появилось большое количество идей, которые можно реализовать, используя новые возможности. Эти проекты будут как улучшать жизнь в моём родном городе, так и (в идеале) приносить доход.

source: Aren't you afraid of difficulties in programming?
ru_ru: Не боишься, что будет сложно в программировании?

source: There have already been a number of problems I had to solve when learning proramming basics.
ru_ru: Когда учишь основы программирования, и без того сталкиваешься с проблемами. К этому привыкаешь и воспринимаешь нормально, если впереди есть более глобальная цель.

source: You know that feeling when you stumble upon something and cannot figure out what's wrong. Then, sometimes after long hours, you figure out... And you become a better coder.
ru_ru: Бывало часами бьёшься над какой-то вроде бы несложной задачей, не понимаешь почему все время вылезает ошибка. Но решение в конце концов приходит, и ты осознаешь, что стал лучше как профессионал.

source: This feeling is AMAZING! It is worth those "wasted" hours of banging your head against the wall.
ru_ru: Это чувство потрясающе! И тогда уже не важно сколько часов было "потрачено впустую". Ты стал лучше, и это самое главное.

source: Sometimes it is really disheartening to see the same error popping up again and again. But overall I am ready to face the numerous challengies, because, again, they make me better.
ru_ru: Иногда просто отчаиваешься, когда одна и та же ошибка появляется снова и снова, и ты уже перебрал вроде бы все средства, чтобы от неё избавиться. В целом я готов встретиться с многочисленными ошибками и вызовами, потому что опять же они делают меня лучше и сильнее. И не было ещё ни одного случая, чтобы я не решил и забросил проблему, с которой столкнулся.

source: The less I know about a particular technology the more vigorous I am to master it and understanding finally comes!
ru_ru: Чем меньше я знаю о какой-то конкретной технологии, тем с большим воодушевлением я ее осваиваю, и через недели дискомфорта понимание, наконец, приходит!

source: How do you learn code?
ru_ru: Как ты учишь программирование?

source: I believe in the power of spaced repetition and use Anki software to learn code theory. Anki helps me learn basic and advanced syntax, which does not replace practice but significantly reduces time one would waste searching and reading docs for things they once did but forgot.
ru_ru: Я верю в силу интервального повторения и использую программу под названием Anki для изучения теории. Anki помогает мне изучить базовый и расширенный синтаксис языков, который не заменяет практику, но значительно сокращает время, которое иначе тратилось бы на поиск и чтение документации к тем моментам, с которыми уже когда-то работал, но подзабыл.

source: What is spaced repetition?
ru_ru: Что такое интервальное повторение?

source: In general learning stages are usually as follows:
ru_ru: Обычно новую технологию я изучаю по следующей схеме:

source: theory from a book or a video tutorial
ru_ru: теория из книги или видео-туториала

source: practice some basic examples of particular pieces of the technology learned
ru_ru: практикую некоторые базовые примеры по некоторым частям данной технологии

source: spaced repetition of the basics during a couple of weeks
ru_ru: интервальное повторение основ технологии в течение пары недель, когда в голове постепенно всё утрясается и приходит понимание, как одна часть связана с другой и т.д.

source: see some real example of app building using this technology
ru_ru: смотрю реальный пример создания приложения с использованием данной технологии

source: build something of my own using this knowledge and googling things I do not know on the go.
ru_ru: делаю некое приложение самостоятельно, используя полученные знания, а также отыскивая в Интернете информацию по тем аспектам, с которыми еще не знаком

source: I think one can code something even knowing only basics. There will always be things you do not know about a specific technology, so sitting and endlessly absorbing information is useless. Better code something simple but working. I wish I used this approach earlier.
ru_ru: Убеждён, что можно "кодить" даже зная только основы. Всегда будут вещи, которые ты не знаешь в той или иной технологии, поэтому бесконечно поглощать теорию также бесполезно. Лучше для начала сделать что-то простое, но работающее. Не обязательно писать код идеально, тем более что начинающий программист вряд ли сможет сделать это.

source: In addition to tutorials I also read industry blogs and sites like habrahabr.ru, CSS Tricks and others. Reading docs as a regular tutorial is a worthy option sometimes, too.
ru_ru: В дополнение к туториалам я читаю профильные блоги и, конечно же, Хабр, CSS Tricks и различные другие ресурсы. Почитать документацию просто для изучения некой технологии также иногда полезно. Выжимка полезной информации из данных ресурсов ложится в Anki для закрепления в памяти.

source: Frequent visitor of Codepen and caniuse.com when learning frontend.
ru_ru: Я частый гость Codepen и caniuse.com при изучении фронтэнда.

source: Are you good at maths?
ru_ru: Как у тебя с математикой?

source: I have a linguistic and international relations diploma, so the syntax of English-like programming languages is like a piece of cake for me. I had good and great marks at school in all subjects, including maths and physics, but math exercises did not go beyond the standard level.
ru_ru: По первому образованию я специалист по международным отношениям и лингвист, поэтому синтаксис англоязычных языков программирования для меня прост в освоении. У меня были хорошие и отличные оценки в школе по всем предметам, включая математику и физику, но математические упражнения не выходили за пределы стандартного уровня.

source: Difficult math tasks are always a challenge for me and I do not love them, but when it comes to coding challenges, it looks more interesting and real-life-oriented, which makes me believe that I will be able to cope even with harder tasks if faced them.
ru_ru: Трудные математические задачи мне даются порой довольно сложно, хотя если долго разбираться, они становятся понятными. Честно сказать, я не очень их люблю, если они касаются абстрактных для меня понятий. Однако веб-программирование прекрасно тем, что даже трудные задачи приходится решать на прикладных ситуациях, и это более интересно. Поэтому думаю, что буду со временем справляться со всё более сложными задачами, тем более что осознаю необходимость изучить алгоритмы (читаю "Руководство по алгоритмам" Скиены и буду изучать продвинутые паттерны проектирования).

source: Now it's time for algorithms and data structures in my life if I really want to eventually become a senior coder.
ru_ru: Сейчас самое время изучить основные алгоритмы и структуры данных, чтобы через годы считать себя крепким программистом.

source: Do you have work experience?
ru_ru: Есть ли у тебя опыт работы в IT?

source: I have never worked for an IT company professionally.
ru_ru: Я никогда не работал в IT компании.

source: The more I learn web development the more passion I have for this industry and hope I already meet the criteria for a promising webdev position.
ru_ru: Но чем больше я изучаю веб-разработку, тем с большим интересам я берусь за новую технологию. Уверен, что уже дорос до уровня, когда могу претендовать на позицию крепкого джуна в плане frontend-разработки.

source: In August 2017, I switched from pure theory to practice and I am currently working on a number of my own web projects that I hope to finish some time in the future.
ru_ru: В августе 2017 г. я переключился с теории на практику. Сейчас я работаю над рядом веб-проектов, которые надеюсь закончить в будущем.

source: My previous work experience includes translating into English and in reverse order for a number of media. I also worked with various clients outside the regular job. My freelance experience taught me how important it is to communicate with clients in the right way and build relations that will bring profits.
ru_ru: Мой предыдущий опыт работы заключался в основном в переводах на английский язык и в обратном порядке для ряда средств массовой информации. Я также работал с разными клиентами в качестве самостоятельной деятельности. Мой внештатный опыт научил меня, насколько важно общаться с клиентами правильно и строить отношения, которые принесут прибыль.

source: Every work that I previously had dealt in any way with websites, SEO and content management.
ru_ru: Так или иначе вся моя предыдущая работа была связана с веб-сайтами, SEO и управлением контентом.

source: What kind of IT job would you prefer?
ru_ru: С какими технологиями ты предпочёл бы работать?

source: I would prefer to work with JS-based web apps and sites. I don't mind using HTML5/CSS3 one day, Javascript/Angular next day and then a bit of (or entirely) Laravel or Node as soon as I learn them.
ru_ru: На данном этапе я хотел бы работать с JS-стеком, поскольку знаю его лучше всего. При этом не чураюсь как простой верстки и работы с CSS, так и пока более сложных для меня Laravel или Node (когда освою их азы получше).

source: It would be a nice experience to be able to touch in real life the technologies I know only slightly.
ru_ru: Было бы классно "потрогать" технологии, которые я знаю лишь на начальном уровне. На реальной работе это настоящий вызов и большая ответственность.

source: In general I am interested in both frontend and backend.
ru_ru: В целом я понял, что одним фронтэндом не обойтись, и чтобы создавать классные веб-приложения и сервисы, нужны знания и в бэкэнде. А еще для верности и что-то из мобильной разработки.

source: Working with JS-based hybrid mobile apps is another promising prospect.
ru_ru: Работа с гибридными мобильными приложениями на JS была бы также интересна.

source: I may consider taking some managerial path in the future to use my knowledge of finance and psychology as well as quench managerial hunger.
ru_ru: Я хотел бы в будущем расти в управленцы IT-сферы, поскольку имею знания в финансах, психологии, а также интерес к профессиональной управленческой деятельности.

source: To see technologies I already know please
ru_ru: Чтобы посмотреть уже изученные мной технологии пожалуйста

source: click here
ru_ru: нажмите здесь

source: What are your concerns about the new job?
ru_ru: Есть ли какие-либо опасения по поводу новой работы?

source: One of the main concerns is that I might work slower than expected through lack of production experience, but maybe I underestimate my abilities...
ru_ru: Одна из основных возможных проблем заключается в том, что я могу работать медленнее, чем ожидалось, из-за отсутствия опыта на продакшене, но, возможно, я недооцениваю свои способности и всё будет хорошо. Ещё переживаю, когда долго не могу справиться с некой ошибкой, хотя всегда в итоге решаю возникающие проблемы.

source: I am a bit afraid of being thrown into thousands of lines of production code without me having time to figure how things work here. Hope to avoid this situation.
ru_ru: Я немного боюсь, что столкнусь с ситуацией, когда передо мной будут тысячи строк продакшн-кода, в котором у меня не будет достаточно времени разобраться. Надеюсь избежать этой ситуации. Чтение чужого кода для меня может быть волнительной процедурой.

source: What about your personal qualities and overall attitude to work?
ru_ru: Что ты можешь рассказать о твоём характере и отношении к работе?

source: I am a person who tends to avoid conflicts and try to collaborate even with difficult people. I prefer to solve problems constructively making concessions and expecting others to do the same.
ru_ru: Я человек, который стремится избегать конфликтов либо решать их предельно мирно и пытается быть со всеми нейтральным. Я понимаю, что каждый человек хорош по-своему. Часто на предыдущих работах получалось так, что ко мне приходили советоваться люди из "противоположных лагерей". В целом предпочитаю решать проблемы конструктивно, делая уступки и ожидая, что другие сделают то же самое.

source: I am professional in my attitude to work and cannot let my teammates down.
ru_ru: У меня профессиональный подход к любой работе. Я никогда не позволю себе подвести команду, даже если для этого надо пожертвовать личным временем. Я также понимаю такое явление, как переработки, однако в строго определенных здравым смыслом количествах.

source: Being a team player at work I love spending time with my family or alone out of work. Honestly, I don't like noisy parties and crowds of people all the time. Better learn something new, watch a quality movie or go for a walk.
ru_ru: Являясь командным игроком на работе, в нерабочее время я люблю проводить время с семьей или наедине сам с собой. Честно говоря, мне не нравятся шумные вечеринки и толпы людей. Лучше потратить время на что-то новое, посмотреть качественный фильм или выйти наконец на воздух :)

source: I not only listen to other people, but also hear them. I perceive objective criticism calmly and think of it as a stimulus to my further growth.
ru_ru: Я умею не просто слушать людей, но и слышать их, тонко чувствую людей. Также положительно отношусь к объективной критике: она является для меня мощным стимулом к развитию.

source: However, I would love to meet new interesting people, especially IT professionals, and learn from them, draw inspiration or maybe collaborate on some new projects. Speaking in public is one of my strong points, I am not afraid of that at all.
ru_ru: Несмотря на некую интровертность, мне бы хотелось встретить в новой для себя профессии новых интересных людей, особенно ИТ-специалистов, учиться у них, черпать вдохновение или, возможно, сотрудничать в проектах. Кстати, в противовес интровертности, я не боюсь выступать на публике, в том числе перед иностранной.

source: I love systems, ordered and working like a clock. I would be glad to join a company where management is based on well-working systems.
ru_ru: Люблю системность во всём: организую процессы, если системы в них нет, и охотно присоединяюсь к чётко отлаженной системе и чётко прописанным стандартам.

source: Do you have hobbies?
ru_ru: Какие у тебя хобби?

source: I love politics, but since Belarus is an authoritarian country and politics actually does not exist here, I have "put aside" politological stuff until better times.
ru_ru: Я люблю политическую аналитику, но поскольку в Беларуси политики сейчас нет, я пока "отложил" политические вещи в долгий ящик.

source: I love Sweden and Nordic countries for their attitude to life and calmness. I have lived in Sweden for about nine months and fell in love with it. Maybe I will work or live there once.
ru_ru: Я люблю Швецию и вообще северные страны за их отношение к жизни и спокойствие. Я прожил в Швеции около девяти месяцев и просто влюбился в эту страну. Возможно когда-нибудь я буду там работать или жить.

source: My other interest lies in football, but I don't watch it much, only a bit of Bundesliga and English Premier League.
ru_ru: Помимо этого интересуюсь футболом (немецкий и английский), но много смотреть нет времени. Люблю качественный юмор.

source: Maybe a bit weird to call it a hobby, but I love taking an English Longman dictionary and just learning new words and phrases. Having a decent level of English now, I do hope I will once be able to come close to speaking English like a native speaker.
ru_ru: Также хочу и далее повышать уровень английского до уровня native speaker. Иногда шучу, что если бы было больше времени, сидел бы за англо-английским словарём в поисках новых аутентичных слов и выражений.

source: Another quirky and seemingly unrealistic idea is to create a real-life political simulator, including with online features, in which you would manage a country on a day-to-day basis, like in Football Manager. Instead of declaring wars and managing the army (which is the predominant feature of other existing simulators), the main goal here would be political fight against opponents and improvement of life in your country via talks, statements and behind-the-scenes intrigues.
ru_ru: Еще хотелось бы когда-нибудь создать политический симулятор, возможно с мультиплеером, по типу Football Manager. Это будет симулятор, в котором фокус не на шаблонном захвате чужих территорий и усилении армии, а на приходе к власти, на работе с оппонентами, переговорах, кулуарной борьбе и т.д.

source: I drink a lot of coffee and tea, often with something sweet :)
ru_ru: Пью много кофе и чая, часто с чем-нибудь сладеньким :)

source: What technologies will you study in the future?
ru_ru: Какие технологии планируешь изучать в будущем?

source: Please see the list of skills I plan to acquire in the future, near or far:
ru_ru: Вот список навыков, которыми я намерен овладеть в будущем:

source: Future skills
ru_ru: Будущие навыки

source: I watch numerous YouTube channels to follow the trending technologies and webdev news. If I see that a technology is getting more and more popular and increasing number of tutorials is created for it, I think whether I absolutely need this technology and monitor the local job market to make the final decision.
ru_ru: Я смотрю многочисленные Youtube-каналы, чтобы оставаться в тренде по новым и существующим технологиям. Если вижу, что та или иная технология становится всё популярнее, в том числе востребованность в Беларуси растёт и сочетается с уже существующими навыками, я скорее всего буду её изучать.

source: Get in touch
ru_ru: На связи!

source: Ilya Kushlianski
ru_ru: Илья Кушлянский

source: I want to plunge into the world of the future, the world of smart and enterprising people, whose income directly depends on their skills and experience.
ru_ru: Хочу погрузиться в развивающийся мир, за которым будущее, в котором нет бездумной политики и зашоренной идеологии. Мир, где уровень дохода напрямую связан с навыками.

source: Uručča neighborhood, Minsk, Belarus
ru_ru: микр-н Уручье, Минск, Беларусь

source: Your message has been sent successfully
ru_ru: Сообщение отправлено

source: I am glad to hear from you! Hope for fruitful cooperation and positive experience. Have a nice week!
ru_ru: Буду рад услышать Ваши предложения! Надеюсь на плодотворное и позитивное сотрудничество. Приятной Вам недели!

source: Your name
ru_ru: Ваше имя

source: Your mail
ru_ru: Ваш email

source: Subject
ru_ru: Тема

source: Awesome job offer for Ilya!
ru_ru: Отличное предложение для Ильи!

source: Your message
ru_ru: Ваше сообщение

source: Please enter your text here...
ru_ru: Текст Вашего сообщения...

source: Ilya
ru_ru: Илья

source: Kushlianski
ru_ru: Кушлянский

source: Beginner developer. Fast learner
ru_ru: Мне всегда мало. Того что уже умею

source: Skills
ru_ru: Навыки

source: As of junior level
ru_ru: Относительно уровня Junior

source: All %s
ru_ru: Все %s

source: Why hire me
ru_ru: Почему я?

source: Ready to hire a beginner but don't want to waste time training them?
ru_ru: Готовы взять начинающего разработчика, но не хотите тратить время и деньги на его обучение с нуля?

source: Looking for a reliable guy who will easily fit into your dev team?
ru_ru: Ищете в команду надежного и неконфликтного человека?

source: Need a team member who won't stop improving skills and learning?
ru_ru: Нужен член команды, который будет постоянно развиваться в сфере информационных технологий?

source: Having freelance experience, I always care about what clients want
ru_ru: Поработав переводчиком на фрилансе, я понимаю, что такое интересы клиента

source: I look at your business as if it was mine and try to find ways to streamline processes
ru_ru: Представляю любой бизнес как свой и ищу процессы, которые можно было бы улучшить

source: Self-taught, I believe you can achieve what you want if you work hard
ru_ru: Выучив азы программирования самостоятельно, я верю, что можно добиться всего что ты хочешь, если упорно работать

source: Contact me
ru_ru: Связаться со мной

source: How else I can benefit you
ru_ru: Почему мне стоит работать у Вас

source: My works
ru_ru: Примеры работ
